ot0tot/betaflight/src/platform/common/stm32/pwm_output_dshot_shared.c
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#ifdef USE_DSHOT

#include "build/debug.h"

#include "drivers/dma.h"
#include "drivers/dma_reqmap.h"
#include "platform/dma.h"
#include "drivers/io.h"
#include "drivers/nvic.h"
#include "platform/rcc.h"
#include "drivers/time.h"
#include "drivers/timer.h"
#include "platform/timer.h"
#if defined(STM32F4)
#include "stm32f4xx.h"
#endif

#include "drivers/pwm_output.h"
#include "drivers/dshot.h"
#include "dshot_dpwm.h"
#include "drivers/dshot_command.h"
#include "drivers/motor.h"

#include "pwm_output_dshot_shared.h"

FAST_DATA_ZERO_INIT uint8_t dmaMotorTimerCount = 0;

#ifdef STM32F7
FAST_DATA_ZERO_INIT motorDmaTimer_t dmaMotorTimers[MAX_DMA_TIMERS];
FAST_DATA_ZERO_INIT motorDmaOutput_t dmaMotors[MAX_SUPPORTED_MOTORS];
#else
motorDmaTimer_t dmaMotorTimers[MAX_DMA_TIMERS];
motorDmaOutput_t dmaMotors[MAX_SUPPORTED_MOTORS];
#endif

#ifdef USE_DSHOT_TELEMETRY
FAST_DATA_ZERO_INIT uint32_t inputStampUs;

FAST_DATA_ZERO_INIT dshotTelemetryCycleCounters_t dshotDMAHandlerCycleCounters;
#endif

#if defined(USE_DSHOT_TELEMETRY) && defined(STM32F4)
#define DSHOT_TELEMETRY_DMA_BACKOFF_MIN 8
#define DSHOT_TELEMETRY_DMA_BACKOFF_MAX 128

static void pwmDshotQuarantineCaptureDma(motorDmaOutput_t *motor)
{
    unsigned backoff = DSHOT_TELEMETRY_DMA_BACKOFF_MIN << motor->telemetryDmaFailureCount;
    if (backoff >= DSHOT_TELEMETRY_DMA_BACKOFF_MAX) {
        backoff = DSHOT_TELEMETRY_DMA_BACKOFF_MAX;
    } else {
        motor->telemetryDmaFailureCount++;
    }

    motor->telemetryDmaQuarantineFrames = backoff;
}
#endif

motorDmaOutput_t *getMotorDmaOutput(unsigned index)
{
    if (index >= ARRAYLEN(dmaMotors)) {
        return NULL;
    }
    return &dmaMotors[index];
}

bool pwmDshotIsMotorIdle(unsigned index)
{
    const motorDmaOutput_t *motor = getMotorDmaOutput(index);
    return motor && motor->protocolControl.value == 0;
}

void pwmDshotRequestTelemetry(unsigned index)
{
    motorDmaOutput_t * const motor = getMotorDmaOutput(index);
    if (motor) {
        motor->protocolControl.requestTelemetry = true;
    }
}

uint8_t getTimerIndex(void *timer)
{
    for (int i = 0; i < dmaMotorTimerCount; i++) {
        if (dmaMotorTimers[i].timer == timer) {
            return i;
        }
    }
    dmaMotorTimers[dmaMotorTimerCount++].timer = timer;
    return dmaMotorTimerCount - 1;
}

/**
 * Prepare to send dshot data for one motor
 *
 * Formats the value into the appropriate dma buffer and enables the dma channel.
 * The packet won't start transmitting until later since the dma requests from the timer
 * are disabled when this function is called.
 *
 * @param index index of the motor that the data is to be sent to
 * @param value the dshot value to be sent
*/
FAST_CODE void pwmWriteDshotInt(uint8_t index, uint16_t value)
{
    motorDmaOutput_t *const motor = &dmaMotors[index];

    if (!motor->configured) {
        return;
    }

#if defined(USE_DSHOT_TELEMETRY) && defined(STM32F4)
    if (useDshotTelemetry && motor->isInput) {
        // Recovery is per stream. Skip this motor until its DMA can be safely
        // returned to output without preventing healthy motors from updating.
        return;
    }
#endif

    /*If there is a command ready to go overwrite the value and send that instead*/
    if (dshotCommandIsProcessing()) {
        value = dshotCommandGetCurrent(index);
        if (value) {
            motor->protocolControl.requestTelemetry = true;
        }
    }

    motor->protocolControl.value = value;

    uint16_t packet = prepareDshotPacket(&motor->protocolControl);
    uint8_t bufferSize;

#ifdef USE_DSHOT_DMAR
    if (useBurstDshot) {
        bufferSize = loadDmaBuffer(&motor->timer->dmaBurstBuffer[timerLookupChannelIndex(motor->timerHardware->channel)], 4, packet);
#if defined(STM32N6) || defined(STM32H5) || defined(STM32C5)
        /* TIM burst-DMA: TIM internally generates DBL+1=4 DMA requests
         * per update event, each consumes one word. BNDT (in source bytes
         * on GPDMA) must cover bufferSize bit-periods × 4 CCRs ×
         * 4 bytes/word = bufferSize * 16 bytes per frame. Pre-N6 stream
         * DMAs counted transfer events, where bufferSize * 4 sufficed. */
        motor->timer->dmaBurstLength = bufferSize * 4 * 4;
#else
        motor->timer->dmaBurstLength = bufferSize * 4;
#endif
    } else
#endif
    {
        bufferSize = loadDmaBuffer(motor->dmaBuffer, 1, packet);

        motor->timer->timerDmaSources |= motor->timerDmaSource;

#ifdef USE_FULL_LL_DRIVER
#if defined(STM32N6) || defined(STM32H5) || defined(STM32C5)
        /* GPDMA channels have no auto-reload — CSAR keeps the post-frame
         * end-pointer and the next EnableResource would replay from the
         * wrong address (drifting forward by bufferSize each kick, until
         * it walks off the buffer and DMA reads back zeros → silent
         * outputs). Rewind the source pointer back to the start of the
         * per-motor DMA buffer before each kick. */
        xLL_EX_DMA_SetMemoryAddress(motor->dmaRef, (uint32_t)motor->dmaBuffer);
        /* GPDMA BNDT is in bytes, not transfers; SrcDataWidth = WORD here */
        xLL_EX_DMA_SetDataLength(motor->dmaRef, bufferSize * 4);
#else
        xLL_EX_DMA_SetDataLength(motor->dmaRef, bufferSize);
#endif
        xLL_EX_DMA_EnableResource(motor->dmaRef);
#else
#ifdef X32M7
        xDMA_Cmd(motor->dmaRef, DISABLE);
#endif
        xDMA_SetCurrDataCounter(motor->dmaRef, bufferSize);

// XXX we can remove this ifdef if we add a new macro for the TRUE/ENABLE constants
#ifdef AT32F435
        xDMA_Cmd(motor->dmaRef, TRUE);
#elif defined(X32M7)
        xDMA_Cmd(motor->dmaRef, DISABLE);
        xDMA_MemoryTargetConfig(motor->dmaRef, (uint32_t)motor->dmaBuffer, 0);
        xDMA_Cmd(motor->dmaRef, ENABLE);
#else
        xDMA_Cmd(motor->dmaRef, ENABLE);
#endif

#endif // USE_FULL_LL_DRIVER
    }

}

#ifdef USE_DSHOT_TELEMETRY

void dshotEnableChannels(unsigned motorCount);

static uint32_t decodeTelemetryPacket(const uint32_t buffer[], uint32_t count)
{
    uint32_t value = 0;
    uint32_t oldValue = buffer[0];
    int bits = 0;
    int len;
    // Level after the first (always falling) edge is 0; toggled on each edge.
    int level = 0;
    for (uint32_t i = 1; i <= count; i++) {
        if (i < count) {
            int diff = buffer[i] - oldValue;
            if (bits >= 21) {
                break; // all bits consumed
            }
            len = (diff + 8) / 16;
            if (len <= 0) {
                break; // guard UB: 1 << (len-1) undefined when len <= 0
            }
            level ^= 1;
        } else {
            // Only pad trailing 1s when the final run is high (level==1).
            // level==0 means the pullup return-to-idle may have been captured
            // as a spurious extra edge; skip padding so the bits != 21 check
            // below rejects the packet (returns 0xffff / DSHOT_TELEMETRY_INVALID).
            len = 21 - bits;
            if (len <= 0 || level == 0) {
                break; // done or spurious pullup edge
            }
        }
        value <<= len;
        value |= 1 << (len - 1);
        if (i < count) {
            oldValue = buffer[i];
        }
        bits += len;
    }
    if (bits != 21) {
        return 0xffff;
    }

    static const uint32_t decode[32] = {
        0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 10, 11, 0, 13, 14, 15,
        0, 0, 2, 3, 0, 5, 6, 7, 0, 0, 8, 1, 0, 4, 12, 0 };

    uint32_t decodedValue = decode[value & 0x1f];
    decodedValue |= decode[(value >> 5) & 0x1f] << 4;
    decodedValue |= decode[(value >> 10) & 0x1f] << 8;
    decodedValue |= decode[(value >> 15) & 0x1f] << 12;

    uint32_t csum = decodedValue;
    csum = csum ^ (csum >> 8); // xor bytes
    csum = csum ^ (csum >> 4); // xor nibbles

    if ((csum & 0xf) != 0xf) {
        return DSHOT_TELEMETRY_INVALID;
    }

    return decodedValue >> 4;
}

#endif

/**
 * Process dshot telemetry packets before switching the channels back to outputs
 *
*/
FAST_CODE_NOINLINE bool pwmTelemetryDecode(void)
{
#ifndef USE_DSHOT_TELEMETRY
    return true;
#else
    if (!useDshotTelemetry) {
        return true;
    }

#ifdef USE_DSHOT_TELEMETRY_STATS
    const timeMs_t currentTimeMs = millis();
#endif
    const timeUs_t currentUs = micros();

    for (int i = 0; i < dshotMotorCount; i++) {
        timeDelta_t usSinceInput = cmpTimeUs(currentUs, inputStampUs);
        if (usSinceInput >= 0 && usSinceInput < dmaMotors[i].dshotTelemetryDeadtimeUs) {
            return false;
        }
        if (dmaMotors[i].isInput) {
            bool captureFault = false;
#if defined(STM32F4)
            TIM_TypeDef * const timer = (TIM_TypeDef *)dmaMotors[i].timerHardware->tim;
            TIM_DMACmd(timer, dmaMotors[i].timerDmaSource, DISABLE);

            uint32_t edges = 0;
            const bool captureActive = dmaMotors[i].telemetryDmaCaptureActive;
            captureFault = dmaMotors[i].telemetryDmaFaultPending;
            if (captureActive) {
                const dmaChannelDescriptor_t *descriptor = dmaGetDescriptorByIdentifier(dmaGetIdentifier(dmaMotors[i].dmaRef));
                const unsigned channelIndex = dmaMotors[i].timerHardware->channel >> 2;
                const uint32_t overcaptureFlag = TIM_SR_CC1OF << channelIndex;

                captureFault |= DMA_GET_FLAG_STATUS(descriptor, DMA_IT_FEIF | DMA_IT_DMEIF | DMA_IT_TEIF) != 0;
                captureFault |= (timer->SR & overcaptureFlag) != 0;
                edges = GCR_TELEMETRY_INPUT_LEN - xDMA_GetCurrDataCounter(dmaMotors[i].dmaRef);

                // Clear both the capture request and overcapture status before
                // this channel is returned to output mode.
                timer->SR = ~((TIM_SR_CC1IF | TIM_SR_CC1OF) << channelIndex);
            }

            dmaMotors[i].telemetryDmaCaptureActive = false;
            dmaMotors[i].telemetryDmaFaultPending = false;
            if (captureFault) {
                // This counter normally records an aborted telemetry capture;
                // a hardware-faulted PWM capture is the equivalent condition.
                DEBUG_SET(DEBUG_DSHOT_TELEMETRY_COUNTS, 2, debug[2] + 1);
                pwmDshotQuarantineCaptureDma(&dmaMotors[i]);
            } else if (captureActive) {
                dmaMotors[i].telemetryDmaFailureCount = 0;
            }
#else
#ifdef USE_FULL_LL_DRIVER
            uint32_t edges = GCR_TELEMETRY_INPUT_LEN - xLL_EX_DMA_GetDataLength(dmaMotors[i].dmaRef);
#else
            uint32_t edges = GCR_TELEMETRY_INPUT_LEN - xDMA_GetCurrDataCounter(dmaMotors[i].dmaRef);
#endif

#ifdef USE_FULL_LL_DRIVER
            LL_EX_TIM_DisableIT((TIM_TypeDef *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource);
#elif defined(AT32F435)
            tmr_dma_request_enable((tmr_type *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource, FALSE);
#elif defined(X32M7)
            TIM_EnableDma((TIM_TypeDef *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource, DISABLE);
#else
            TIM_DMACmd((TIM_TypeDef *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource, DISABLE);
#endif
#endif

            uint16_t rawValue;

            if (!captureFault && edges > MIN_GCR_EDGES) {
                dshotTelemetryState.readCount++;

                rawValue = decodeTelemetryPacket(dmaMotors[i].dmaBuffer, edges);

                if (rawValue != DSHOT_TELEMETRY_INVALID) {
                    // Check EDT enable or store raw value
                    if ((rawValue == 0x0E00) && (dshotCommandGetCurrent(i) == DSHOT_CMD_EXTENDED_TELEMETRY_ENABLE)) {
                        dshotTelemetryState.motorState[i].telemetryTypes = 1 << DSHOT_TELEMETRY_TYPE_STATE_EVENTS;
                    } else {
                        dshotTelemetryState.motorState[i].rawValue = rawValue;
                    }
                } else {
                    dshotTelemetryState.invalidPacketCount++;
                    if (i == 0) {
                        memcpy(dshotTelemetryState.inputBuffer, dmaMotors[i].dmaBuffer, sizeof(dshotTelemetryState.inputBuffer));
                    }
                }
#ifdef USE_DSHOT_TELEMETRY_STATS
                updateDshotTelemetryQuality(&dshotTelemetryQuality[i], rawValue != DSHOT_TELEMETRY_INVALID, currentTimeMs);
#endif
            }
        }
        pwmDshotSetDirectionOutput(&dmaMotors[i]);
    }

    dshotTelemetryState.rawValueState = DSHOT_RAW_VALUE_STATE_NOT_PROCESSED;
    inputStampUs = 0;
    dshotEnableChannels(dshotMotorCount);
    return true;
#endif // USE_DSHOT_TELEMETRY
}

#endif // USE_DSHOT
